---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalNodeConnectionStatus
source: html/40b4bfd9-4c97-acc9-3759-66756d8e5d4a.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalNodeConnectionStatus

Indicates the Connections Status for an Analytical Node.

## Syntax (C#)
```csharp
public enum AnalyticalNodeConnectionStatus
```